Revit 2024 API
HostedSweepType Class
An object that represents the attributes for sweep host objects in Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class HostedSweepType : HostObjAttributes
Visual Basic
Public Class HostedSweepType _
	Inherits HostObjAttributes
Visual C++
public ref class HostedSweepType : public HostObjAttributes
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.HostObjAttributes
 Autodesk.Revit.DB.HostedSweepType
 Autodesk.Revit.DB.Architecture.FasciaType
 Autodesk.Revit.DB.Architecture.GutterType
 Autodesk.Revit.DB.SlabEdgeType
See Also
HostedSweepType Members
Autodesk.Revit.DB Namespace